root643/unsolo-key/ch32fun/misc/attic/iSLER_preMarch2026.h
typedef struct {
	// bits 0..5 = Channel
	// bit 6 = disable whitening.
	// bit 8 = 1 during normal TX/operation, but clearing does not affect TX.  Note: 0 at reset, set in software.
	// bit 9 = settable, but unknown effect.
	// bit 10 = 1 during normal TX/operation, but clearing does not affect TX.  Note: 1 at reset, not touched in software.
	// bit 16 = cleared by firmware upon TX, but does not seem to have an effect on the TX.
	// bit 17 = settable, but unknown effect
	// bit 20 = settable, but unknown effect.
	// bit 24 = set at end of tx routine
	// bit 29-31 = settable, but unknown effect.
	volatile uint32_t BB0; // CTRL_CFG
	volatile uint32_t BB1; // CRCINIT1
	volatile uint32_t BB2; // ch570/2: CRCPOLY1, [ch582/3 ch591/2]: ACCESSADDRESS1
	volatile uint32_t BB3; // ch570/2 ACCESSADDRESS1
	volatile uint32_t BB4;
	volatile uint32_t BB5;
	volatile uint32_t BB6;
	volatile uint32_t BB7;
	volatile uint32_t BB8;
	volatile uint32_t BB9;
	volatile uint32_t BB10;
	volatile uint32_t BB11; // ch582/3, ch584/5, ch591/2: CTRL_TX
	volatile uint32_t BB12;

	// default, pre TX is a4000009
	// bit 0: Set normally, but cleared in software when TXing (maybe a ready bit?)
	// bit 1: Unset normally, but cleared anyway by software when TXing (maybe a fault bit?)
	// bit 2: Disables TX.
	// bit 4: Normally 0, but, if set to 1, seems to increase preamble length.
	// bit 8: Normally 0, but, if set, no clear effect.
	// bit 9: Normally 0, but, if set, no clear effect.
	// bits 24-30: TX Power.  Normally 0xA4
	// Oddly, bit 31 seems to maybe be always set.
	volatile uint32_t BB13; // ch570/2: CTRL_TX
	volatile uint32_t BB14;
	volatile uint32_t BB15;
	volatile uint32_t BB16;
	volatile uint32_t BB17;
	volatile uint32_t BB18;
	volatile uint32_t BB19;
	volatile uint32_t BB20;
	volatile uint32_t BB21;
	volatile uint32_t BB22; // ch570/2: CRCINIT2
	volatile uint32_t BB23; // ch570/2: CRCPOLY2
	volatile uint32_t BB24; // ch570/2: ACCESSADDRESS2
} BB_Type;

typedef struct {
	volatile uint32_t LL0;
	volatile uint32_t LL1;
	volatile uint32_t LL2; // STATUS
	volatile uint32_t LL3; // INT_EN
	volatile uint32_t LL4;
	volatile uint32_t LL5;
	volatile uint32_t LL6;
	volatile uint32_t LL7;
	volatile uint32_t LL8;
	volatile uint32_t LL9;
	volatile uint32_t LL10;
	volatile uint32_t LL11;
	volatile uint32_t LL12;
	volatile uint32_t LL13;
	volatile uint32_t LL14;
	volatile uint32_t LL15;
	volatile uint32_t LL16;
	volatile uint32_t LL17;
	volatile uint32_t LL18;
	volatile uint32_t LL19;

	// Controls a lot of higher-level functions.
	//  For Tuning: 0x30558
	//  For  Idle:  0x30000
	//  For Sending:0x30258
	// Bit 3: Somehow, enables BB
	// Bit 4: Normally 1, controls length/send times of BB, if unset, BB will double-send part of signals.
	// Bit 6: Normally 1, Unknown effect.
	// Bit 9: If 0, no output.
	// Bit 10: Somehow required for TX?
	// Bit 16-17: Normally 1, unknown effect. Seems to suppress odd carrier burst after message.
	volatile uint32_t LL20; // CTRL_MOD
	volatile uint32_t LL21;
	volatile uint32_t LL22;
	volatile uint32_t LL23;
	volatile uint32_t LL24; // ch571/3: TMR
	volatile uint32_t LL25; // ch570/2, ch582/3, ch591/2: TMR
	volatile uint32_t LL26;
	volatile uint32_t LL27;
	volatile uint32_t LL28; // ch582/3: TXBUF
	volatile uint32_t LL29; // ch582/3: RXBUF
	volatile uint32_t LL30; // ch570/2, ch591/2: TXBUF
	volatile uint32_t LL31; // ch570/2, ch591/2: RXBUF
} LL_Type;

typedef struct {
	volatile uint32_t RF0;
	volatile uint32_t RF1;
	volatile uint32_t RF2;
	volatile uint32_t RF3;
	volatile uint32_t RF4;
	volatile uint32_t RF5;
	volatile uint32_t RF6;
	volatile uint32_t RF7;
	volatile uint32_t RF8;
	volatile uint32_t RF9;
	volatile uint32_t RF10;
	volatile uint32_t RF11;
	volatile uint32_t RF12;
	volatile uint32_t RF13;
	volatile uint32_t RF14; // TXTUNE_CTRL
	volatile uint32_t RF15;
	volatile uint32_t RF16;
	volatile uint32_t RF17;
	volatile uint32_t RF18;
	volatile uint32_t RF19;
	volatile uint32_t RF20;
	volatile uint32_t RF21;
	volatile uint32_t RF22;
	volatile uint32_t RF23;
	volatile uint32_t RF24;
	volatile uint32_t RF25;
	volatile uint32_t RF26;
	volatile uint32_t RF27;
	volatile uint32_t RF28;
	volatile uint32_t RF29;
	volatile uint32_t RF30;
	volatile uint32_t RF31;
	volatile uint32_t RF32;
	volatile uint32_t RF33;
	volatile uint32_t RF34;
	volatile uint32_t RF35;
	volatile uint32_t RF36; // TXCTUNE_CO_CTRL
	volatile uint32_t RF37; // TXCTUNE_GA_CTRL
	volatile uint32_t RF38;
	volatile uint32_t RF39; // RXTUNE
	volatile uint32_t RF40[10]; // TXCTUNE_CO[10]
	volatile uint32_t RF50[3]; // TXCTUNE_GA[3]
} RF_Type;

uint8_t channel_map[] = {1,2,3,4,5,6,7,8,9,10,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,0,11,39};
#define CO_MID (uint8_t)(RF->TXTUNE_CTRL & ~0xffffffc0)
#define GA_MID (uint8_t)((RF->TXTUNE_CTRL & ~0x80ffffff) >> 24)

#define PHY_1M 1
#define PHY_2M 2
#define PHY_S2 4
#define PHY_S8 8

void DevSetMode(uint16_t mode);
__attribute__((aligned(4))) uint32_t LLE_BUF[0x110];
#ifdef CH571_CH573
__attribute__((aligned(4))) uint32_t LLE_BUF2[0x110];
#endif
volatile uint32_t tuneFilter;
volatile uint32_t tuneFilter2M;
#ifndef ISLER_CALLBACK
volatile uint32_t rx_ready;
#endif


#ifdef CH571_CH573
__attribute__((interrupt))
void BB_IRQHandler() {
	// printf("BB\n");
	if(BB->BB14 & (1<<6)) {
		BB->BB14 &= 0xffffff9f;
	}
	if(BB->BB14 & (1<<1)) {
		BB->BB14 = 0xfffffffd;
		BB->BB20 = 0x45;
	}
	if(BB->BB14 & (1<<4)) {
		BB->BB14 = 0xffffffef;
		BB->BB20 = 0;
	}
}
#endif

__attribute__((interrupt))
void LLE_IRQHandler() {
	int rx_flag = 0;
#ifdef CH571_CH573
	if(LL->STATUS & (1<<9)) {
		LL->TMR = 400;
		BB->CTRL_TX = (BB->CTRL_TX & 0xfffffffc) | 2;
		BB->CTRL_CFG |= 0x10000000;
		rx_flag = 1; // XXX TODO: Figure out which bit is the RX bit.
	}
	LL->STATUS = 0;
#elif defined(CH582_CH583)
	if((LL->STATUS & (1<<14)) && (LL->INT_EN & (1<<14))) {
		LL->LL26 = 0xffffffff;
		LL->STATUS = 0x4000;
		rx_flag = 1; // XXX TODO: Figure out which bit is the RX bit.
	}
	else
#endif
	{
		rx_flag = LL->STATUS & 1;
		LL->STATUS &= LL->INT_EN;
		BB->CTRL_TX = (BB->CTRL_TX & 0xfffffffc) | 1;
	}
	DevSetMode(0);
	LL->CTRL_MOD &= CTRL_MOD_RFSTOP;
	LL->LL0 |= 0x08;

