root643/unsolo-key/ch32fun/misc/attic/iSLER_preMarch2026.h
	if( rx_flag )
	{
#ifdef ISLER_CALLBACK
		ISLER_CALLBACK();
#else
		rx_ready = 1;
#endif
	}
}

void RFEND_Reset() {
#ifdef CH571_CH573
	RF->RF3 |= 0x1000;
	ADD_N_NOPS(20);
	RF->RF3 &= 0xffffefff;
	ADD_N_NOPS(20);
	RF->RF3 |= 0x1000;
	ADD_N_NOPS(20);
	RF->RF3 |= 1;
	ADD_N_NOPS(20);
	RF->RF3 &= 0xfffffffe;
	ADD_N_NOPS(20);
	RF->RF3 |= 1;
	ADD_N_NOPS(20);
	RF->RF3 |= 0x100;
	ADD_N_NOPS(20);
	RF->RF3 &= 0xfffffeff;
	ADD_N_NOPS(20);
	RF->RF3 |= 0x100;
	ADD_N_NOPS(20);
#elif defined(CH32V208)
	RF->RF3 = 0x1101;
	ADD_N_NOPS(20);
	RF->RF3 = 0;
	ADD_N_NOPS(20);
	RF->RF3 = 0x1101;
#endif
}

void DevInit(uint8_t TxPower) {
#ifdef CH571_CH573
	DMA->DMA4 = (uint32_t)LLE_BUF;
	DMA->DMA5 = (uint32_t)LLE_BUF;
	DMA->DMA6 = (uint32_t)LLE_BUF2;
	DMA->DMA7 = (uint32_t)LLE_BUF2;
	DMA->DMA2 |= 0x2000;
	DMA->DMA3 |= 0x2000;
	DMA->DMA2 |= 0x1000;
	DMA->DMA3 |= 0x1000;
	DMA->DMA0 |= 2;
	DMA->DMA0 |= 0x20;

	LL->LL5 = 0x50;
	LL->LL7 = 10;
	LL->LL9 = 0x8c;
	LL->LL13 = 0x8c;
	LL->LL17 = 0x50;
	LL->LL19 = 10;
#elif defined(CH570_CH572) || defined(CH582_CH583) || defined(CH584_CH585) || defined(CH591_CH592)
	LL->LL5 = 0x8c;
	LL->LL7 = 0x76;
	LL->LL9 = 0x8c;
	LL->LL13 = 0x8c;
	LL->LL17 = 0x8c;
	LL->LL19 = 0x76;
#elif defined(CH32V208)
	LL->LL5 = 0x8c;
	LL->LL7 = 0x6c;
	LL->LL9 = 0x8c;
	LL->LL13 = 0x8c;
	LL->LL17 = 0x8c;
	LL->LL19 = 0x6c;
#endif

#ifdef CH570_CH572
	LL->LL11 = 0x6c;
	LL->LL15 = 0x6c;
	LL->LL1 = 0x78;
	LL->LL21 = 0;
	LL->INT_EN = 0x16000f;
#elif defined(CH571_CH573)
	LL->LL11 = 0x3c;
	LL->LL15 = 0x3c;
	LL->LL22 = 0xf6;
	LL->INT_EN = 0xc303;
	NVIC->FIBADDRR = 0x20000000;
	NVIC->VTFADDR[2] = (uint32_t)LLE_IRQHandler -NVIC->FIBADDRR;
#elif defined(CH582_CH583) || defined(CH32V208)
	LL->LL11 = 0x3c;
	LL->LL15 = 0x3c;
	LL->INT_EN = 0xf00f;
#elif defined(CH584_CH585)
	LL->LL11 = 0x6e;
	LL->LL15 = 0x6e;
	LL->LL1 &= 0xffffffe1;
	LL->LL21 = 0;
	LL->INT_EN = 0x1f000f;
#elif defined(CH591_CH592)
	LL->LL6 = 0x78;
	LL->LL8 = 0xffffffff;
	LL->LL11 = 0x6e;
	LL->LL21 = 0x14;
	LL->INT_EN = 0x1f000f;
#endif

	LL->RXBUF = (uint32_t)LLE_BUF;
	LL->STATUS = 0xffffffff;
	RF->RF10 = 0x480;

#ifdef CH570_CH572
	RF->RF12 &= 0xfff9ffff;
	RF->RF12 |= 0x70000000;
	RF->RF15 = (RF->RF15 & 0xf8ffffff) | 0x2000000;
	RF->RF15 = (RF->RF15 & 0x1fffffff) | 0x40000000;
	RF->RF18 &= 0xfff8ffff;
	RF->RF20 = (RF->RF20 & 0xfffff8ff) | 0x300;
	RF->RF23 |= 0x70000;
	RF->RF23 |= 0x700000;

	BB->BB14 = 0x2020c;
	BB->BB15 = 0x50;
	BB->CTRL_TX = (BB->CTRL_TX & 0x1ffffff) | (TxPower | 0x40) << 0x19;
	BB->CTRL_CFG &= 0xfffffcff;
#elif defined(CH571_CH573) || defined(CH582_CH583) || defined(CH32V208)
	RFEND_Reset();
	RF->RF18 = (RF->RF18 & 0x8fffffff) | 0x20000000;
	RF->RF18 = (RF->RF18 & 0xf8ffffff) | 0x4000000;
	RF->RF18 = (RF->RF18 & 0xfffffff0) | 9;
	RF->RF18 &= 0xfff8ffff;
	RF->RF18 |= 0x80000000;
	RF->RF19 = (RF->RF19 & 0xfffffff8) | 3;
	RF->RF19 = (RF->RF19 & 0xffffff8f) | 0x30;
	RF->RF19 = (RF->RF19 & 0xfffff8ff) | 0x300;
	RF->RF19 &= 0xfeffffff;
	RF->RF19 |= 0x2000000;
	RF->RF20 = (RF->RF20 & 0xffff0fff) | 0x4000;
	RF->RF21 = (RF->RF21 & 0xfffffff0) | 0xc;
	RF->RF21 |= 0x80;
	RF->RF21 &= 0xffffefff;
	RF->RF15 = (RF->RF15 & 0xffff0fff) | 0x8000;
	RF->RF15 = (RF->RF15 & 0xf8ffffff) | 0x2000000;
	RF->RF15 = (RF->RF15 & 0x1fffffff) | 0x40000000;
	RF->RF11 |= 0x700000;
	RF->RF11 &= 0xf8ffffff;
	RF->RF11 = (RF->RF11 & 0xffffcfff) | 0x2000;
	RF->RF11 = (RF->RF11 & 0xfffcffff) | 0x20000;
	RF->RF12 &= 0xfffffff0;
	RF->RF12 &= 0xffffff0f;
	RF->RF12 &= 0xfffff8ff;
	RF->RF12 |= 0x700000;
	RF->RF12 = (RF->RF12 & 0x8fffffff) | 0x50000000;
	RF->TXTUNE_CTRL = (RF->TXTUNE_CTRL & 0xff07ffff) | RFEND_TXCTUNE_INIT;
	RF->TXTUNE_CTRL |= 0x80000000;

#ifdef CH571_CH573
	BB->CTRL_CFG = (TxPower << 8) | BB->CTRL_CFG | 0x1008000;
	BB->CTRL_CFG = (BB->CTRL_CFG & 0xffffc0ff) | (TxPower & 0x3f) << 8;
	SYS_SAFE_ACCESS(
		R16_AUX_POWER_ADJ = (TxPower < 0x15) ? (R16_AUX_POWER_ADJ & 0xffef):
												(R16_AUX_POWER_ADJ | 0x10);
		);
	BB->CTRL_TX = 0x10e78;
	BB->BB6 |= 0x8000;
	BB->BB6 = (BB->BB6 & 0xffff807f) | 0x3500;
	BB->BB13 = 0x152;

	// NVIC->VTFADDR[3] = (uint32_t)BB_IRQHandler +0x14000000; // why 14000000?
#elif defined(CH582_CH583) || defined(CH32V208)
	BB->CTRL_CFG |= 0x800000;
	BB->CTRL_CFG |= 0x10000000;
	BB->BB13 = 0x1d0;
	BB->CTRL_TX = TxPower << 0x19 | CTRL_TX_TXPOWER;
	BB->CTRL_TX = (BB->CTRL_TX & 0x81ffffff) | (TxPower & 0x3f) << 0x19;
	BB->BB8 = 0x90083;

	// NVIC->VTFADDR[3] = (uint32_t)BB_IRQHandler +0x20000000; // why 20000000?
#endif
#elif defined(CH584_CH585) || defined(CH591_CH592)
	RF->RF12 = (RF->RF12 & 0x8fffffff) | 0x10077700;
	RF->RF15 = (RF->RF15 & 0x18ff0fff) | 0x42005000;
	RF->RF19 &= 0xfffcff88;
	RF->RF21 = (RF->RF21 & 0xfffffff0) | 9;
	RF->RF23 &= 0xff88ffff;

	BB->CTRL_CFG |= 0x800000;
	BB->BB14 = 0x3ff; // ch584/5
	BB->BB13 = 0x50;
	BB->CTRL_TX = (BB->CTRL_TX & 0x81ffffff) | (TxPower & 0x3f) << 0x19;
	uint32_t uVar3 = 0x1000000;
	uint32_t uVar4 = RF->RF23 & 0xf8ffffff;
	if(TxPower < 29) { // ch585: 27
		/* uVar3 and uVar4 are initialized properly already */
	}
	else if(TxPower < 35) {
		uVar3 = 0x3000000;
	}
	else if(TxPower < 59) {
		uVar3 = 0x5000000;
	}
	else {
		uVar4 = RF->RF23;
		uVar3 = 0x7000000;
	}
	RF->RF23 = uVar4 | uVar3;
	BB->BB15 = 0x2020c; // ch584/5
	BB->BB4 = (BB->BB4 & 0xffffffc0) | 0xe;
#endif

	NVIC->VTFIDR[3] = 0x14;
}

void DevSetMode(uint16_t mode) {
#if !defined(CH571_CH573)
	if(mode) {
		BB->CTRL_CFG = DEVSETMODE_ON;
		RF->RF2 |= 0x330000;
	}
	else {
		BB->CTRL_CFG = DEVSETMODE_OFF;
		RF->RF2 &= 0xffcdffff;
	}
#ifdef CH582_CH583
	mode = (mode == 0) ? 0x80 : mode;
#elif !defined(CH32V208)
	mode |= 0x30000;
#endif
#endif // ! CH571_CH573
	LL->CTRL_MOD = mode;
}

uint32_t RFEND_TXCTune(uint8_t channel) {
	// 0xbf = 2401 MHz
	RF->RF1 &= 0xfffffffe;
	RF->TXTUNE_CTRL = (RF->TXTUNE_CTRL & 0xfffe00ff) | (0xbf00 + (channel_map[channel] << 8));
	RF->RF1 |= 1;

	LL->TMR = 8000;
	while(!(RF->TXCTUNE_CO_CTRL & (1 << 25)) || !(RF->TXCTUNE_CO_CTRL & (1 << 26))) {
		if(LL->TMR == 0) {
			break;
		}
	}

	uint8_t nCO = (uint8_t)RF->TXCTUNE_CO_CTRL & 0x3f;
	uint8_t nGA = (uint8_t)(RF->TXCTUNE_GA_CTRL >> 10) & 0x7f;

