root643/unsolo-key/ch32fun/misc/attic/iSLER_preMarch2026.h
	// printf("nCO,nGA ch:%u idx:%u %u,%u\n", channel, channel_map[channel], nCO,nGA);

	return (nGA << 24) | nCO;
}

void RFEND_TXTune() {
	RF->RF1 &= 0xfffffeff;
	RF->RF10 &= 0xffffefff;
	RF->RF11 &= 0xffffffef;
	RF->RF2 |= 0x20000;
	RF->RF1 |= 0x10;

	// 2401 MHz
	uint32_t tune2401 = RFEND_TXCTune(37);
	uint8_t nCO2401 = (uint8_t)(tune2401 & 0x3f);
	uint8_t nGA2401 = (uint8_t)(tune2401 >> 24) & 0x7f;

	// 2480 MHz
	uint32_t tune2480 = RFEND_TXCTune(39);
	uint8_t nCO2480 = (uint8_t)(tune2480 & 0x3f);
	uint8_t nGA2480 = (uint8_t)(tune2480 >> 24) & 0x7f;

	// 2440 MHz
	uint32_t tune2440 = RFEND_TXCTune(18);
	uint8_t nCO2440 = (uint8_t)(tune2440 & 0x3f);
	uint8_t nGA2440 = (uint8_t)(tune2440 >> 24) & 0x7f;

	uint32_t dCO0140 = nCO2401 - nCO2440;
	uint32_t dCO4080 = nCO2440 - nCO2480;
	uint8_t tune = 0;
	uint8_t int_points = sizeof(RF->TXCTUNE_CO) /2;
	uint8_t txctune_co[sizeof(RF->TXCTUNE_CO)] = {0};
	for(int f = 0; f < int_points; f++) {
		tune = (dCO0140 * (int_points -f)) / int_points;
		txctune_co[f] = tune | (tune << 4);
	}
	for(int f = int_points; f < sizeof(RF->TXCTUNE_CO); f++) {
		tune = (dCO4080 * (f -int_points)) / int_points;
		txctune_co[f] = tune | (tune << 4);
	}
	for(int i = 0; i < sizeof(txctune_co) /4; i++) {
		RF->TXCTUNE_CO[i] = ((uint32_t*)txctune_co)[i];
	}

	// This GA interpolating is not exactly what is done in EVT
	// Actually the reception on a BLE monitor is better when this is left out completely
	// This will need some proper experimentation by people with 2.4GHz SDRs
	uint32_t dGA0140 = nGA2401 - nGA2440;
	uint32_t dGA4080 = nGA2440 - nGA2480;
	int_points = sizeof(RF->TXCTUNE_GA) /2;
	uint8_t txctune_ga[sizeof(RF->TXCTUNE_GA)] = {0};
	for(int f = 1; f < int_points; f++) {
		tune = (dGA0140 * (int_points -f)) / int_points;
		txctune_ga[f] = tune | (tune << 4);
	}
	for(int f = int_points; f < sizeof(RF->TXCTUNE_GA) -1; f++) {
		tune = (dGA4080 * (f -int_points)) / int_points;
		txctune_ga[f] = tune | (tune << 4);
	}
	for(int i = 0; i < (sizeof(txctune_ga) /4); i++) {
		RF->TXCTUNE_GA[i] = ((uint32_t*)txctune_ga)[i];
	}


#if 0
	printf("2401 2440 2480 CO: %u %u %u, GA: %u %u %u\n", nCO2401, nCO2440, nCO2480, nGA2401, nGA2440, nGA2480);
	for(int i = 0; i < 10; i++ ) {
		printf( "%d: %08lx\n", i, RF->TXCTUNE_CO[i] );
	}
	for(int i = 0; i < 3; i++ ) {
		printf( "%d: %08lx\n", i, RF->TXCTUNE_GA[i] );
	}
#endif

	RF->RF1 &= 0xffffffef;
	RF->RF1 &= 0xfffffffe;
	RF->RF10 |= 0x1000;
	RF->RF11 |= 0x10;
	RF->TXTUNE_CTRL = (RF->TXTUNE_CTRL & 0xffffffc0) | (tune2440 & 0x3f);
	RF->TXTUNE_CTRL = (RF->TXTUNE_CTRL & 0x80ffffff) | (tune2440 & 0x7f000000);

	// FTune
	RF->RF1 |= 0x100;
}

void RFEND_RXTune() {
	RF->RF20 &= 0xfffeffff;
	RF->RF2 |= 0x200000;
	RF->RF3 = (RF->RF3 & 0xffffffef) | 0x10;
	RF->RF1 |= 0x1000;

	LL->TMR = 100;
	while(LL->TMR && ((RF->RXTUNE >> 8) & 1));

	tuneFilter = RF->RXTUNE & 0x1f;
	RF->RF20 |= 0x10000;
	RF->RF20 = (RF->RF20 & 0xffffffe0) | tuneFilter;
	RF->RF2 &= 0xffdfffff;
	tuneFilter2M = (tuneFilter +2 < 0x1f) ? (tuneFilter +2) : 0x1f;

	// RXADC
	RF->RF22 &= 0xfffeffff;
	RF->RF2 |= 0x10000;
	RF->RF3 = (RF->RF3 & 0xfffffeff) | 0x100;
	RF->RF1 = (RF->RF1 & 0xfffeffff) | 0x100000;
}

void RegInit() {
	DevSetMode(DEVSETMODE_TUNE);
	RFEND_TXTune();
	RFEND_RXTune();
	DevSetMode(0);
}

void iSLERInit(uint8_t TxPower) {
#if defined(CH571_CH573) || defined(CH584_CH585) // maybe all?
	NVIC->IENR[0] = 0x1000;
	NVIC->IRER[0] = 0x1000;
#endif
	DevInit(TxPower);
	RegInit();
	NVIC->IPRIOR[0x15] |= 0x80;
	NVIC_EnableIRQ(LLE_IRQn);
}

void DevSetChannel(uint8_t channel) {
#ifdef CH571_CH573
	BB->BB6 = (BB->BB6 & 0xf8ffffff) | 0x4000000;
	BB->BB6 = (BB->BB6 & 0xffffff83) | 0x1c;
#endif
	RF->RF11 &= 0xfffffffd;
	BB->CTRL_CFG = (BB->CTRL_CFG & 0xffffff80) | (channel & 0x7f);
}

__HIGH_CODE
int iSLERRSSI() {
#ifdef CH570_CH572
	uint8_t *tx_buf = (uint8_t*)LLE_BUF;
	int len = tx_buf[1];
	return (int8_t)tx_buf[len +4];
#else
	return (int8_t)(BB->RSSI >> 0xf);
#endif
}

__HIGH_CODE
int iSLERCRCOK() {
#ifdef CH570_CH572
	uint8_t *tx_buf = (uint8_t*)LLE_BUF;
	int len = tx_buf[1];
	return (int8_t)!(tx_buf[len + 5] & 0x10);
#else
	// Unimplemented!
	return -1;
#endif
}

__HIGH_CODE
void iSLERTX(uint32_t access_address, uint8_t adv[], size_t len, uint8_t channel, uint8_t phy_mode) {
	BB->CTRL_TX = (BB->CTRL_TX & 0xfffffffc) | 1;

	DevSetChannel(channel);

	// Uncomment to disable whitening to debug RF.
	//BB->CTRL_CFG |= (1<<6);
	DevSetMode(DEVSETMODE_TX);

	BB->ACCESSADDRESS1 = access_address; // access address
	BB->CRCINIT1 = 0x555555; // crc init
#ifdef CH570_CH572
	BB->ACCESSADDRESS2 = access_address;
	BB->CRCINIT2 = 0x555555;
	BB->CRCPOLY1 = (BB->CRCPOLY1 & 0xff000000) | 0x80032d; // crc poly
	BB->CRCPOLY2 = (BB->CRCPOLY2 & 0xff000000) | 0x80032d;
#endif

#if defined(CH571_CH573)
	DMA->TXBUF = (uint32_t)adv;
#else
	LL->TXBUF = (uint32_t)adv;
#endif

	// Wait for tuning bit to clear.
	for( int timeout = 3000; !(RF->RF26 & 0x1000000) && timeout >= 0; timeout-- );

#if defined(CH582_CH583) || defined(CH32V208)
	BB->CTRL_CFG = (phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M:
				   (phy_mode == PHY_S2) ? CTRL_CFG_PHY_CODED:
				   (phy_mode == PHY_S8) ? CTRL_CFG_PHY_CODED:
										  CTRL_CFG_PHY_1M; // default 1M for now
	if(phy_mode > PHY_2M) { // coded phy
		BB->CTRL_CFG = (BB->CTRL_CFG & 0xffff3fff) | ((phy_mode == PHY_S2) ? 0x4000 : 0);
	}
#elif defined(CH571_CH573)
	BB->CTRL_CFG = CTRL_CFG_PHY_1M; // no 2M PHY on ch571/3
#else
	BB->CTRL_CFG = (phy_mode == PHY_2M) ? CTRL_CFG_PHY_2M:
										  CTRL_CFG_PHY_1M; // default 1M for now
#endif

#if defined(CH570_CH572)
	BB->BB9 = (BB->BB9 & 0xf9ffffff) | ((phy_mode == PHY_2M) ? 0 : 0x2000000);
#endif

#if defined(CH571_CH573)
	BB->BB11 = (BB->BB11 & 0xfffffffc); // |2 for RX
#endif

	// This clears bit 17 (If set, seems to have no impact.)
	LL->LL4 &= 0xfffdffff;

#if !defined(CH571_CH573)
	LL->STATUS = LL_STATUS_TX;
#endif
	LL->TMR = (uint32_t)(len *512); // needs optimisation, per phy mode

	BB->CTRL_CFG |= CTRL_CFG_START_TX;
	BB->CTRL_TX &= 0xfffffffc;

	LL->LL0 = 2; // Not sure what this does, but on RX it's 1

	while(LL->TMR); // wait for tx buffer to empty
	DevSetMode(0);
	if(LL->LL0 & 3) {
		LL->CTRL_MOD &= CTRL_MOD_RFSTOP;
		LL->LL0 |= 0x08;
	}
}

__HIGH_CODE
void iSLERRX(uint32_t access_address, uint8_t channel, uint8_t phy_mode) {
	DevSetMode(0);
	if(LL->LL0 & 3) {
		LL->CTRL_MOD &= CTRL_MOD_RFSTOP;
		LL->LL0 |= 0x08;
	}
	LL->TMR = 0;

